---
title: FilteredWorksetIterator
classe: Autodesk.Revit.DB.FilteredWorksetIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# FilteredWorksetIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Workset Current { get; }` | `filteredWorksetIterator.Current` | Workset |
| `Boolean IsValidObject { get; }` | `filteredWorksetIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `filteredWorksetIterator.Dispose()` | Void |
| `Workset GetCurrent()` | `filteredWorksetIterator.GetCurrent()` | Workset |
| `Boolean IsDone()` | `filteredWorksetIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `filteredWorksetIterator.MoveNext()` | Boolean |
| `Void Reset()` | `filteredWorksetIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```